app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "email", "created_at", "name", "encrypted_password", "updated_at") VALUES ('8ec7d1336aef45d80e31480dfaa64c6b544ed524b1b9772fe21c8689b7742be9', 'zenpoy.register@gmail.comt', '2011-11-24 15:49:23.923463', 'sadasdasdasd', 'a7fa750d041ca8ababd4d8b305da4f643b8714fd89b582778296125ef21f8d25', '2011-11-24 15:49:23.923463')
---
  def create
    @user = User.new(params[:user])
    if @user.save